# vim: set filetype=ruby:

# Command-line essentials (and preferably GNU).
brew 'ack'
brew 'ag'
brew 'bash'
brew 'bash-completion'
brew 'coreutils'
brew 'ctags'
brew 'curl'
brew 'findutils'
brew 'fzf'
brew 'gawk'
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gnupg2'
brew 'gpg-agent'
brew 'htop'
brew 'irssi'
brew 'jq'
brew 'moreutils'
brew 'neovim'
brew 'nmap'
brew 'openssl'
brew 'readline'
brew 'reattach-to-user-namespace'
brew 'rename'
brew 'shellcheck'
brew 'ssh-copy-id'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'zsh'
brew 'zsh-completions'

# Opt-in on an as-needed basis.
#
# -- Clojure --
# brew 'leiningen'
#
# -- Go --
# brew 'go'
#
# -- Ruby --
# brew 'rbenv'
# brew 'ruby'
# brew 'ruby-build'
#
# -- Node --
# brew 'node'
# brew 'nvm'
#
# -- React & React Native --
# brew 'watchman'
#
# -- Python --
# brew 'python'
# brew 'python3'
#
# -- gRPC & Protocol Buffers --
# brew 'grpc'
# brew 'protobuf'
#
# -- Cloud --
# brew 'kubernetes-cli'
#
# -- Codecs --
# brew 'webp'
# brew 'lz4'
#
# -- Misc --
# brew 'exercism'


# The core set of executables I use frequently enough to warrant automatic
# installation on any personal machine.
cask 'alfred'
cask 'caffeine'
cask 'crashplan'
cask 'dashlane'
cask 'duet'
cask 'electrum'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'java'
cask 'kindle'
cask 'sketch'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'
