# vim: set filetype=ruby:

tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'neovim/neovim'

# Command-line essentials (and preferably GNU).
brew 'ack'
brew 'bash'
brew 'coreutils'
brew 'ctags'
brew 'curl', args: ['with-nghttp2']
brew 'findutils'
brew 'gawk'
brew 'git'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'gpg2'
brew 'jq'
brew 'lz4'
brew 'moreutils'
brew 'neovim/neovim/neovim'
brew 'openssl'
brew 'ssh-copy-id'
brew 'tmux'
brew 'vim'
brew 'zsh'

# The core set of executables I use frequently enough to warrant automatic
# installation on any personal machine.
cask 'alfred'
cask 'caffeine'
cask 'crashplan'
cask 'dashlane'
cask 'dropbox'
cask 'duet'
cask 'flux'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'java'
cask 'kindle'
cask 'seil'
cask 'send-to-kindle'
cask 'slack'
cask 'spotify'
cask 'telegram'
cask 'the-unarchiver'
cask 'transmission'
cask 'vlc'

# More specific. Opt-in on an as-needed basis. Much of this could also be
# containerized and might not necessitate an explicit system-wide installation
# step.
#
# brew 'exercism'
# brew 'go'
# brew 'leiningen'
# brew 'node'
# brew 'rbenv'
# brew 'ruby-build'
# brew 'shellcheck'
